Table of Contents
 Class MatConcreteIND
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material concrete IND
[OpenModelClass("CI.StructModel.Libraries.Material.IND.MatConcreteIND,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatConcrete))]
public class MatConcreteIND : MatConcrete
Inheritance
object
OpenObject
OpenElementId
Material
MatConcrete
MatConcreteIND
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 MatConcreteIND()
Constructor
public MatConcreteIND()
Properties
 Fck
Compressive strength of concrete
public double Fck { get; set; }
Property Value
double
 Edit this page